Revit 2024 API
BuiltInFailures.SplitSketchBasedElementFailures Properties
The BuiltInFailures.SplitSketchBasedElementFailures type exposes the following members.
Properties
Name | Description
NotSplitValidRegions
 The split failed. There may be a gap in the boundary loop or the sketch may be incomplete.
See Also
BuiltInFailures.SplitSketchBasedElementFailures Class
Autodesk.Revit.DB Namespace